particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
	USART_DeInit(usartMap[serial]->usart_peripheral);

	usartMap[serial]->usart_enabled = false;

	HAL_USART_Configure_Pin_Modes(serial, config);

	// Enable USART Clock
	*usartMap[serial]->usart_apbReg |=  usartMap[serial]->usart_clock_en;

	// Connect USART pins to AFx
	STM32_Pin_Info* PIN_MAP = HAL_Pin_Map();
	GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_rx_pin].gpio_peripheral, usartMap[serial]->usart_rx_pinsource, usartMap[serial]->usart_af_map);
	GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_tx_pin].gpio_peripheral, usartMap[serial]->usart_tx_pinsource, usartMap[serial]->usart_af_map);

	// NVIC Configuration
	NVIC_InitTypeDef NVIC_InitStructure;
	// Enable the USART Interrupt
	NVIC_InitStructure.NVIC_IRQChannel = usartMap[serial]->usart_int_n;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 7;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	// USART default configuration
	// USART configured as follow:
	// - BaudRate = (set baudRate as 9600 baud)
	// - Word Length = 8 Bits
	// - One Stop Bit
	// - No parity
	// - Hardware flow control disabled for Serial1/2/4/5
	// - Hardware flow control enabled (RTS and CTS signals) for Serial3
	// - Receive and transmit enabled
	// USART configuration
	USART_InitStructure.USART_BaudRate = baud;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

	// Flow control configuration
	switch (config & SERIAL_FLOW_CONTROL) {
		case SERIAL_FLOW_CONTROL_CTS:
			USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
			break;
		case SERIAL_FLOW_CONTROL_RTS:
			USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
			break;
		case SERIAL_FLOW_CONTROL_RTS_CTS:
			USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
			break;
		case SERIAL_FLOW_CONTROL_NONE:
		default:
			USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
			break;
	}

	if (serial == HAL_USART_SERIAL1) {
		// USART1 supports hardware flow control, but RTS and CTS pins are not exposed
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	}

#if PLATFORM_ID == 10 // Electron
	if (serial == HAL_USART_SERIAL4 || serial == HAL_USART_SERIAL5) {
		// UART4 and UART5 do not support hardware flow control
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	}
#endif // PLATFORM_ID == 10

#if USE_USART3_HARDWARE_FLOW_CONTROL_RTS_CTS    // Electron
	if (serial == HAL_USART_SERIAL3)
	{
		USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
	}
#endif

	switch (USART_InitStructure.USART_HardwareFlowControl) {
		case USART_HardwareFlowControl_CTS:
			HAL_Pin_Mode(usartMap[serial]->usart_cts_pin, AF_OUTPUT_PUSHPULL);
			GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
			break;
		case USART_HardwareFlowControl_RTS:
			HAL_Pin_Mode(usartMap[serial]->usart_rts_pin, AF_OUTPUT_PUSHPULL);
			GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
			break;
		case USART_HardwareFlowControl_RTS_CTS:
			HAL_Pin_Mode(usartMap[serial]->usart_cts_pin, AF_OUTPUT_PUSHPULL);
			HAL_Pin_Mode(usartMap[serial]->usart_rts_pin, AF_OUTPUT_PUSHPULL);
			GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_cts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
			GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->usart_rts_pin].gpio_pin_source, usartMap[serial]->usart_af_map);
			break;
		case USART_HardwareFlowControl_None:
		default:
			break;
	}

	// Stop bit configuration.
	switch (config & SERIAL_STOP_BITS) {
		case SERIAL_STOP_BITS_1: // 1 stop bit
			USART_InitStructure.USART_StopBits = USART_StopBits_1;
			break;
		case SERIAL_STOP_BITS_2: // 2 stop bits
			USART_InitStructure.USART_StopBits = USART_StopBits_2;
			break;
		case SERIAL_STOP_BITS_0_5: // 0.5 stop bits
			USART_InitStructure.USART_StopBits = USART_StopBits_0_5;
			break;
		case SERIAL_STOP_BITS_1_5: // 1.5 stop bits
			USART_InitStructure.USART_StopBits = USART_StopBits_1_5;
			break;
	}

	// Data bits configuration
	switch (HAL_USART_Calculate_Word_Length(config, 0)) {
		case 8:
			USART_InitStructure.USART_WordLength = USART_WordLength_8b;
			break;
		case 9:
			USART_InitStructure.USART_WordLength = USART_WordLength_9b;
			break;
	}

	// Parity configuration
	switch (config & SERIAL_PARITY) {
		case SERIAL_PARITY_NO:
			USART_InitStructure.USART_Parity = USART_Parity_No;
			break;
		case SERIAL_PARITY_EVEN:
			USART_InitStructure.USART_Parity = USART_Parity_Even;
			break;
		case SERIAL_PARITY_ODD:
			USART_InitStructure.USART_Parity = USART_Parity_Odd;
			break;
	}

	// Disable LIN mode just in case
	USART_LINCmd(usartMap[serial]->usart_peripheral, DISABLE);

	// Configure USART
	USART_Init(usartMap[serial]->usart_peripheral, &USART_InitStructure);

	// LIN configuration
	if (config & LIN_MODE) {
		// Enable break detection
		switch(config & LIN_BREAK_BITS) {
			case LIN_BREAK_10B:
				USART_LINBreakDetectLengthConfig(usartMap[serial]->usart_peripheral, USART_LINBreakDetectLength_10b);
				break;
			case LIN_BREAK_11B:
				USART_LINBreakDetectLengthConfig(usartMap[serial]->usart_peripheral, USART_LINBreakDetectLength_11b);
				break;
		}
	}

	if (config & SERIAL_HALF_DUPLEX) {
		HAL_USART_Half_Duplex(serial, ENABLE);
	}

	USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TC, DISABLE);

	// Enable the USART
	USART_Cmd(usartMap[serial]->usart_peripheral, ENABLE);

	if (config & LIN_MODE) {
		USART_LINCmd(usartMap[serial]->usart_peripheral, ENABLE);
	}

	usartMap[serial]->usart_config = config;
	usartMap[serial]->usart_enabled = true;
	usartMap[serial]->usart_transmitting = false;

	// Enable USART Receive and Transmit interrupts
	USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, ENABLE);
	USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_RXNE, ENABLE);
}

void HAL_USART_End(HAL_USART_Serial serial)
{
	// Wait for transmission of outgoing data
	while (usartMap[serial]->usart_tx_buffer->head != usartMap[serial]->usart_tx_buffer->tail);

	// Disable the USART
	USART_Cmd(usartMap[serial]->usart_peripheral, DISABLE);

	// Disable LIN mode
	USART_LINCmd(usartMap[serial]->usart_peripheral, DISABLE);

	// Deinitialise USART
	USART_DeInit(usartMap[serial]->usart_peripheral);

	// Disable USART Receive and Transmit interrupts
	USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_RXNE, DISABLE);
	USART_ITConfig(usartMap[serial]->usart_peripheral, USART_IT_TXE, DISABLE);

	NVIC_InitTypeDef NVIC_InitStructure;

